app/controllers/movies_controller.rb

  def search
    @movie = Movie.find(params[:id])
    if @movie.director.blank?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]