app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def search
    @movie = Movie.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    # retrieve movie ID from URI route
    @movie = Movie.find(params[:id]) # look up movie by unique ID

INSERT INTO "movies" ("title", "rating", "description", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Default title"], ["rating", "PG"], ["description", "blah blah"], ["director", "Any director"], ["created_at", "2017-07-08 15:51:50.465329"], ["updated_at", "2017-07-08 15:51:50.465329"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "director" = ?, "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", ""], ["title", "Star Wars"], ["updated_at", "2017-07-17 04:52:16.243229"], ["id", 14]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)